In [70]:
import pandas as pd

In [71]:
df = pd.read_csv('C:\Workspace\SEfactory\pandas_assignment_3\kc_house_data.csv')

In [72]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

Numerical and Categorical Variables

There are two different categories of variables, numerical data and categorical data. Numerical data is in the from of numbers and they refer to a quantitative value. Numerical data can be used for arithmatical calculations. Categorical data on the other hand is a data type that has a qualitative value, these are often in the form of names or labels and they can be used for descriptive analysis. However, sometimes categorical data can take on numerical values, such as 0s and 1s for example to designate gender. In our dataset the bathrooms column is assigned numerical values but they actually represent a categorical label of 'quarter' 'half' or 'full' bathrooms

Part 2:

In [128]:
column= ['price', 'bedrooms', 'bathrooms','sqft_living','zipcode'] 
adf= df[column].copy()
adf.head()

      price  bedrooms  bathrooms  sqft_living  zipcode
0  221900.0         3       1.00         1180    98178
1  538000.0         3       2.25         2570    98125
2  180000.0         2       1.00          770    98028
3  604000.0         4       3.00         1960    98136
4  510000.0         3       2.00         1680    98074

In [129]:
adf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price        21613 non-null  float64
 1   bedrooms     21613 non-null  int64
 2   bathrooms    21613 non-null  float64
 3   sqft_living  21613 non-null  int64
 4   zipcode      21613 non-null  int64
dtypes: float64(2), int64(3)
memory usage: 844.4 KB

In [130]:
import numpy as np
missing_percentage = 0.2
mask = np.random.rand(*adf.shape) < missing_percentage
adf[mask] = np.nan

In [131]:
#adf.info()
adf.head()

      price  bedrooms  bathrooms  sqft_living  zipcode
0  221900.0       NaN        NaN       1180.0  98178.0
1  538000.0       3.0       2.25       2570.0  98125.0
2  180000.0       2.0       1.00        770.0  98028.0
3  604000.0       4.0        NaN       1960.0  98136.0
4  510000.0       3.0       2.00          NaN      NaN

In [132]:
adf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price        17282 non-null  float64
 1   bedrooms     17319 non-null  float64
 2   bathrooms    17293 non-null  float64
 3   sqft_living  17264 non-null  float64
 4   zipcode      17254 non-null  float64
dtypes: float64(5)
memory usage: 844.4 KB

In [133]:
adf.dropna(subset=['price'], inplace=True)
adf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17282 entries, 0 to 21611
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price        17282 non-null  float64
 1   bedrooms     13856 non-null  float64
 2   bathrooms    13839 non-null  float64
 3   sqft_living  13798 non-null  float64
 4   zipcode      13841 non-null  float64
dtypes: float64(5)
memory usage: 810.1 KB

In [134]:
adf.mode()

      price  bedrooms  bathrooms  sqft_living  zipcode
0  450000.0       3.0        2.5       1010.0  98103.0

In [135]:
adf.mode().iloc[0]

price          450000.0
bedrooms            3.0
bathrooms           2.5
sqft_living      1010.0
zipcode         98103.0
Name: 0, dtype: float64

In [136]:
adf.describe()

              price      bedrooms     bathrooms   sqft_living       zipcode
count  1.728200e+04  13856.000000  13839.000000  13798.000000  13841.000000
mean   5.406377e+05      3.371897      2.116591   2081.462676  98077.738603
std    3.712805e+05      0.941624      0.771170    917.718027     53.370576
min    7.500000e+04      0.000000      0.000000    290.000000  98001.000000
25%    3.230000e+05      3.000000      1.750000   1430.000000  98033.000000
50%    4.500000e+05      3.000000      2.250000   1920.000000  98065.000000
75%    6.438375e+05      4.000000      2.500000   2553.750000  98117.000000
max    7.700000e+06     33.000000      8.000000  13540.000000  98199.000000

In [137]:
adf['bedrooms'].mean()

3.371896651270208

In [143]:
adf['bathrooms']=adf['bathrooms'].fillna(adf['bathrooms'].median())

In [144]:
adf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17282 entries, 0 to 21611
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price        17282 non-null  float64
 1   bedrooms     13856 non-null  float64
 2   bathrooms    17282 non-null  float64
 3   sqft_living  13798 non-null  float64
 4   zipcode      13841 non-null  float64
dtypes: float64(5)
memory usage: 810.1 KB

In [145]:
adf['sqft_living']=adf['bathrooms'].fillna(adf['sqft_living'].median())
adf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17282 entries, 0 to 21611
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price        17282 non-null  float64
 1   bedrooms     13856 non-null  float64
 2   bathrooms    17282 non-null  float64
 3   sqft_living  17282 non-null  float64
 4   zipcode      13841 non-null  float64
dtypes: float64(5)
memory usage: 810.1 KB

In [146]:
adf['bedrooms']=adf['bedrooms'].fillna(adf['bedrooms'].median())
adf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17282 entries, 0 to 21611
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price        17282 non-null  float64
 1   bedrooms     17282 non-null  float64
 2   bathrooms    17282 non-null  float64
 3   sqft_living  17282 non-null  float64
 4   zipcode      13841 non-null  float64
dtypes: float64(5)
memory usage: 810.1 KB

In [148]:
adf['zipcode']=adf['zipcode'].fillna(0)
adf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17282 entries, 0 to 21611
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price        17282 non-null  float64
 1   bedrooms     17282 non-null  float64
 2   bathrooms    17282 non-null  float64
 3   sqft_living  17282 non-null  float64
 4   zipcode      17282 non-null  float64
dtypes: float64(5)
memory usage: 810.1 KB